clear all;
X=[0.3 0.7 1.3 1.4 1.9 2 2.5 3.1 4];
Y=[-2 -5 -7 -8 -11 -12 -16 -17 -25];
%subplot(3, 1, 1); %2 графика 1 1 место в перв строке 1 колонке
%plot(X,Y);
%subplot(3, 1, 2); %1 колонка 2 строка

[f,a0, a1]=method_of_squares(X,Y);
plot(X,f(X),X,Y);
legend('0.05-6.01.*x','Исходная функция')

function [y, a0, a1]=method_of_squares(X,Y)
n=size(X,2); %определяем размер массива
A=[n sum(X); sum(X) sum(X.^2)]; %матрица
b=[sum(Y); sum(X.*Y)]; %столбец свободных членов
Kf=inv(A)*b; %находим решение системы(обратная квадратная матрица на столбец св. членов) 
a0=Kf(1); % параметры
a1=Kf(2);
y=@(x)(a0+a1.*x); %1-ой степени
end

